{
  "navbar": {
    "about": "About Me",
    "services": "Services",
    "portfolio": "Portfolio",
    "contact": "Contact Me",
    "skills": "Skills",
    "experience": "Experiences"
  },

  "about": {
    "title": "About",
    "as": "As a ",
    "highlight": "Full Stack Software Engineer",
    "description": "with 3+ years of experience, I design, develop, and optimize web applications from architecture to deployment. I write clean, scalable code to ensure high performance and a seamless user experience. Passionate about problem-solving and continuous learning, I thrive on tackling complex challenges and building efficient, innovative solutions. I actively explore new technologies through side projects, refining my skills and staying ahead of industry trends. With keen attention to detail and a commitment to best practices, I deliver robust, scalable solutions aligned with business goals and industry standards."
  },
  "home": {
    "iam": "I'AM",
    "description": "Full Stack Engineer Passionate About",
    "secondDescription": "Crafting Innovative Solutions Through Code.",
    "resume": "Resume"
  },
  "services": {
    "title": "Services",
    "frontend": {
      "title": "Frontend Development",
      "description": "Leveraging modern frameworks like React and Angular, I will craft a responsive, visually appealing frontend for your website or mobile app. Focus will be placed on performance optimization to ensure fast, smooth user experiences across all devices while aligning the design with your brand’s identity."
    },
    "backend": {
      "title": "Backend Development",
      "description": "Secure, scalable APIs will be developed to power your application's core functionality, ensuring efficient data flow. Robust databases will be designed for seamless storage and retrieval of data, while backend logic will be optimized to ensure performance, security, and reliability."
    },
    "fullstack": {
      "title": "Full-Stack Application",
      "description": "A seamless full-stack solution will be created, integrating a dynamic frontend with a powerful backend. Real-time features like live notifications or chat systems will be added, while third-party services such as payment gateways and cloud storage will be integrated to extend your app’s functionality."
    },
    "devops": {
      "title": "DevOps and Deployment",
      "description": "Automated CI/CD pipelines will be implemented to streamline your development and deployment processes, ensuring faster, reliable releases. Your application will be deployed on scalable cloud platforms like AWS or Azure, while Docker and Kubernetes will be used for containerization and orchestration to improve management."
    },
    "maintenance": {
      "title": "Maintenance and Support",
      "description": "Ongoing support will ensure your application runs smoothly, with bug fixes and new features added as needed. Performance monitoring will identify and resolve bottlenecks, keeping your app fast and reliable, while regular updates will maintain the latest security standards and technologies."
    },
    "consulting": {
      "title": "Consulting and Training",
      "description": "I will guide you in selecting the best tools and technologies to achieve your business objectives, mentor your development team to improve their skills and boost productivity, and deliver customized workshops to help you and your team master full-stack development."
    }
  },
  "skills": {
    "skills": "My Skills"
  },
  "contact": {
    "contactMe": "Contact Me",
    "thanks": "Thanks for Scrolling",
    "copyRight": "All rights reserved."
  },
  "experience": {
    "title": "Experiences",
    "backendEngineer": "Backend Engineer",
    "frontendDeveloper": "Frontend Developer",
    "backendEngineerTasks": {
      "1": "Built scalable Java/Spring Boot backends for banking applications, serving 1M+ users with 99.9% uptime and 30% faster APIs.",
      "2": "Architected and implemented secure backend infrastructures for retail and corporate banking, enhancing data integrity and access control, processing 2M+ annual transactions.",
      "3": "Developed and maintained a JSP/PrimeFaces-based back-office system, streamlining administrative operations for bank management that cut admin time by 35%.",
      "4": "Contributed to mission-critical banking applications, supporting millions of users with secure and efficient financial services.",
      "5": "Designed and optimized business processes using BPMN and Flowable, improving workflow automation and boosting efficiency by 30%.",
      "6": "Successfully developed and deployed a Java-based authentication system with a custom Keycloak SPI and SOAP, enhancing security by 25% and seamlessly integrated with the existing banking application.",
      "7": "Mentored interns by providing technical guidance, fostering professional growth, and cultivating best coding practices."
    },
    "frontendDeveloperTasks": {
      "1": "Developed 20+ reusable React.js components, reducing development time by 25%, and deployed on Bit Cloud.",
      "2": "Enhanced real-time streaming for live meetings and video services, reducing latency by 30% and boosting concurrent user capacity by 50%.",
      "3": "Maintained projects by adding features, optimizing performance, and fixing bugs.",
      "4": "Achieved 95% test coverage with Jest/React Testing Library, cutting production bugs by 40%.",
      "5": "Transformed UI/UX designs into responsive, high-performance sites, boosting engagement by 30% and reducing load time.",
      "6": "Led the development of a Vue.js video player, implemented new features, and optimized performance, achieving a 15% improvement.",
      "7": "Migrated projects from REST to GraphQL, reducing API calls by 40% and doubling data retrieval speed.",
      "8": "Developed new features and maintained a large B2S2C solution using Angular.",
      "9": "Resolved critical issues, reducing system downtime by 40%.",
      "10": "Contributed to the development of two Angular projects: B2S (Business to Shop) and S2C (Shop to Customer).",
      "11": "Built a scalable B2B platform with React, TypeScript, and Ant Design, enhancing UI responsiveness by 50%."
    }
  }
}
