{
  "navbar": {
    "about": "A Propos",
    "services": "Services",
    "portfolio": "Portfolio",
    "contact": "Contactez-moi",
    "skills": "Compétences",
    "experience": "Expériences"
  },

  "about": {
    "title": "À propos",
    "as": "En tant qu' ",
    "highlight": "Ingénieur Logiciel Full Stack",
    "description": "avec plus de 3 ans d'expérience, je me spécialise dans la conception et le développement d'applications web, de l'architecture au déploiement. Je m'assure que chaque aspect du logiciel est conçu de manière optimale, en garantissant à la fois scalabilité, performances et expérience utilisateur fluide. Passionné par la résolution de problèmes complexes et l'apprentissage continu, j'aime relever des défis complexes et créer des solutions innovantes et efficaces. J'explore activement de nouvelles technologies à travers des projets personnels, affinant mes compétences et restant à jour avec les tendances du secteur. Avec une grande attention aux détails et un engagement envers les meilleures pratiques, je fournis des solutions robustes et évolutives, alignées sur les objectifs commerciaux et les normes de l'industrie."
  },
  "home": {
    "iam": "Je suis",
    "description": "Ingénieur Full Stack Passionné par",
    "secondDescription": "la Création de Solutions Innovantes à Travers le Code.",
    "resume": "CV"
  },
  "services": {
    "title": "Services",
    "frontend": {
      "title": "Développement Frontend",
      "description": "En utilisant des frameworks modernes comme React et Angular, je créerai un frontend réactif et visuellement attrayant pour votre site web ou application mobile. L'accent sera mis sur l'optimisation des performances pour garantir une expérience utilisateur rapide et fluide sur tous les appareils, tout en alignant le design avec l'identité de votre marque."
    },
    "backend": {
      "title": "Développement Backend",
      "description": "Des API sécurisées et évolutives seront développées pour alimenter la fonctionnalité principale de votre application, assurant un flux de données efficace. Des bases de données robustes seront conçues pour un stockage et une récupération des données sans faille, tandis que la logique backend sera optimisée pour garantir des performances, une sécurité et une fiabilité maximales."
    },
    "fullstack": {
      "title": "Application Full-Stack",
      "description": "Une solution full-stack fluide sera créée, intégrant un frontend dynamique avec un backend puissant. Des fonctionnalités en temps réel comme des notifications en direct ou des systèmes de chat seront ajoutées, tandis que des services tiers tels que les passerelles de paiement et le stockage en cloud seront intégrés pour étendre les fonctionnalités de votre application."
    },
    "devops": {
      "title": "DevOps et Déploiement",
      "description": "Des pipelines CI/CD automatisés seront mis en place pour rationaliser vos processus de développement et de déploiement, garantissant des versions plus rapides et fiables. Votre application sera déployée sur des plateformes cloud évolutives comme AWS ou Azure, tandis que Docker et Kubernetes seront utilisés pour la conteneurisation et l'orchestration afin d'améliorer la gestion."
    },
    "maintenance": {
      "title": "Maintenance et Support",
      "description": "Un support continu assurera le bon fonctionnement de votre application, avec des corrections de bugs et l'ajout de nouvelles fonctionnalités selon les besoins. La surveillance des performances identifiera et résoudra les goulots d'étranglement, garantissant ainsi que votre application reste rapide et fiable, tandis que des mises à jour régulières maintiendront les derniers standards de sécurité et technologies."
    },
    "consulting": {
      "title": "Consultation et Formation",
      "description": "Je vous guiderai dans le choix des meilleurs outils et technologies pour atteindre vos objectifs commerciaux, je guiderai votre équipe de développement pour améliorer ses compétences et augmenter la productivité, et je proposerai des ateliers personnalisés pour vous aider, vous et votre équipe, à maîtriser le développement full-stack."
    }
  },
  "skills": {
    "skills": "Compétences"
  },
  "contact": {
    "contactMe": "Contactez-moi",
    "thanks": "Merci de votre visite",
    "copyRight": "Tous droits réservés."
  },
  "experience": {
    "title": "Expériences Professionnelles",
    "backendEngineer": "Ingénieur Backend",
    "frontendDeveloper": "Développeur Frontend",
    "backendEngineerTasks": {
      "1": "Développé des systèmes back-end évolutifs en Java/Spring Boot pour des applications bancaires, desservant plus d’un million d’utilisateurs avec une disponibilité de 99,9% et des API 30% plus rapides.",
      "2": "Conçu et mis en place des infrastructures backend sécurisées pour la banque de détail et la banque d’entreprise, renforçant l’intégrité des données et le contrôle d’accès, avec plus de 2 millions de transactions annuelles.",
      "3": "Développé et maintenu un système back-office basé sur JSP/PrimeFaces, rationalisant les opérations administratives pour la gestion bancaire et réduisant le temps administratif de 35%.",
      "4": "Contribué à des applications bancaires critiques, offrant des services financiers sécurisés et efficaces à des millions d’utilisateurs.",
      "5": "Conçu et optimisé des processus métier à l’aide de BPMN et Flowable, améliorant l’automatisation des workflows et augmentant l’efficacité de 30%.",
      "6": "Créé un système d’authentification basé sur Java avec un SPI personnalisé pour Keycloak et SOAP, renforçant la sécurité de 25%.",
      "7": "Encadré des stagiaires en fournissant des conseils techniques, en favorisant leur développement professionnel et en cultivant les meilleures pratiques de codage."
    },
    "frontendDeveloperTasks": {
      "1": "Création de 20+ composants React.js modulaires, optimisant le cycle de développement (+25% gain sur 5+ projets).",
      "2": "Optimisation du streaming en temps réel : latence -30%, capacité utilisateur +50%.",
      "3": "Maintenance proactive : ajout de fonctionnalités, amélioration des performances, correction de bugs.",
      "4": "Tests unitaires (95% coverage via Jest/RTL) réduisant les bugs en prod de 40%.",
      "5": "Conversion de maquettes UI/UX en sites responsives : engagement +30%, chargement optimisé.",
      "6": "Dirigé le projet lecteur vidéo Vue.js, intégrant des fonctionnalités pour une performance améliorée de 15%.",
      "7": "Migration REST vers GraphQL : appels API -40%, débit de données doublé.",
      "8": "Développé de nouvelles fonctionnalités et assuré la maintenance d’une solution B2S2C d’envergure utilisant Angular.",
      "9": "Résolu des problèmes critiques, réduisant ainsi l’indisponibilité du système de 40%.",
      "10": "Contribué au développement de deux projets Angular : B2S (Business to Shop) et S2C (Shop to Customer).",
      "11": "Conçu une plateforme B2B évolutive avec React, TypeScript et Ant Design, améliorant la réactivité de l’interface utilisateur de 50%."
    }
  }
}
